<a href="https://colab.research.google.com/github/btramduong0810/dsc-mod-1-project-v2-1-online-ds-sp-000/blob/master/Data_Science_in_Action_The_Movie_Industry.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Final Project Submission

* Student name: **BAO TRAM DUONG**
* Student pace: **SELF-PACED DATA SCIENCE PROGRAM**
* Scheduled project review date/time: 
* Instructor name: **JEFF HERMAN**
* Blog post URL:

# **Part I: Table of Contents**

**1.  Introduction**

1.1  Business Statement

**2.  Data Cleaning & Preparation From Provided Data**

I.2.1  Methodology

I.2.2  Data reading

I.2.3  Data cleaning

I.2.4  Joining the dataframes

I.2.5 Quick data analysis

# **1. INTRODUCTION**

## **1.1 Business Statement**

Microsoft sees all the big companies creating original video content, and they want to get in on the fun. They have decided to create a new movie studio, but the problem is they don’t know anything about creating movies. They have hired a team of data scientist from Flatiron to help them better understand the movie industry. The team is charged with doing data analysis and creating a presentation that explores what type of films are currently doing the best at the box office. The team must then translate those findings into actionable insights that the CEO can use when deciding what type of films they should be creating.

What makes a movie succesful and how do we create the next blockbuster movie that can return the highest ROI possible?

# 2. DATA CLEANING & PREPARATION FROM PROVIDED DATA

## **I.2.1 Methodology**

## **I.2.2 Data Source**

Data for this project was obtained from the following repository and also saved in ZippedData folder in this repository.

The data comes from:

1.   Box Office Mojo
2.   IMDB
3.   Rotten Tomatoes
4.   TheMovieDB.org

## I.2.3 Data Reading

First, import all required packages:

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

/Users/baotramduong8/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

From a glance, we see that we have many files to go through. Let's use glob() to retrieve all the file paths:

In [2]:
#the glob module is used to retrieve files/pathnames matching a specified pattern
from glob import glob

In [3]:
# Create a list of all .csv files using glob()
csv_files = glob("./zippedData/*.csv.gz")
csv_files

['./zippedData/imdb.title.crew.csv.gz',
 './zippedData/tmdb.movies.csv.gz',
 './zippedData/imdb.title.akas.csv.gz',
 './zippedData/imdb.title.ratings.csv.gz',
 './zippedData/imdb.name.basics.csv.gz',
 './zippedData/imdb.title.basics.csv.gz',
 './zippedData/tn.movie_budgets.csv.gz',
 './zippedData/bom.movie_gross.csv.gz',
 './zippedData/imdb.title.principals.csv.gz']

In [4]:
len(csv_files) #we need to go through 9 .csv files

9

In [5]:
# Create a list of all tsv files using glob
tsv_files = glob("./zippedData/*.tsv.gz")
tsv_files

['./zippedData/rt.reviews.tsv.gz', './zippedData/rt.movie_info.tsv.gz']

In [6]:
len(tsv_files) #and 2 .tsv files

2

As we will see, there are a lot of information to go through. However, because of the time constraint and for the scope of this project, I will selectively pick and choose just a few features to do analysis on.

**Create dataframes from provided data**

In [183]:
#Create dataframe
movies_df = pd.read_csv('./zippedData/tmdb.movies.csv.gz') #selected
movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

**movies_df** is selected for 'original_language', 'popularity', 'vote_average' and 'vote_count'

Positive word of mouth has an enormous effect on the success of the movie. It's not just how positive the reviews are but also the number of reviews that can predict box office success. We can use the movie_df and title_rating below to observe the correlation between vote_count, vote_average and genres to see which genre has the highest attention from the audience. It also includes release date, which is also an important factor contributing to the movie success i.e. the timing and appropriateness of its release schedule.

In [184]:
#Create dataframe
movie_budgets_df = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz') #selected
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [185]:
#Create dataframe
movie_gross_df = pd.read_csv('./zippedData/bom.movie_gross.csv.gz') #selected
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

When it comes to box office dollars, the recipe for a successful movie is pretty simple: small budget + massive ticket sales = huge profit! Hence, we will utilize the **movie_budgets_df** and **movie_gross_df** to do further analysis on them.

In [186]:
#Create dataframe
title_basics_df = pd.read_csv('./zippedData/imdb.title.basics.csv.gz') #selected
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

Features that are worth investigating are 'genre', 'realease date and 'runtime'. We will pick **title_basics_df** to work with.

**As mentioned above, many things are outside the scope of this project. We will not use these dataframes below:**

In [187]:
#Create dataframe
title_rating_df = pd.read_csv('./zippedData/imdb.title.ratings.csv.gz') #selected
title_rating_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [188]:
#Create dataframe
title_crew_df = pd.read_csv('./zippedData/imdb.title.crew.csv.gz') #not selected
title_crew_df.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [189]:
#Create dataframe
name_basics_df = pd.read_csv('./zippedData/imdb.name.basics.csv.gz') #not selected
name_basics_df.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [190]:
#Create dataframe
title_aka_df = pd.read_csv('./zippedData/imdb.title.akas.csv.gz') #not selected
title_aka_df.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [191]:
#Create dataframe
title_principals_df = pd.read_csv('./zippedData/imdb.title.principals.csv.gz') #not selected
title_principals_df.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [192]:
#Create dataframe
movie_info_df = pd.read_table('./zippedData/rt.movie_info.tsv.gz', delimiter = '\t', encoding = 'latin-1') #not selected
movie_info_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [193]:
#Create dataframe
reviews_df = pd.read_table('./zippedData/rt.reviews.tsv.gz', delimiter = '\t', encoding = 'latin-1') #not selected
reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

## I.2.4 Data Cleaning

1. Remove duplicates or irrelevant observations
2. Handle misisng data
3. Filter unwanted outliers

## I.2.4.a Production budget and gross

First investigate the budget and gross since this is the purpose of this project is to make money. Let's see our data once more time:

**movie_budgets_df**

We are interested 'release_date', 'movie', 'production_budget', 'domestic_gross', and 'worldwide_gross'

In [194]:
#look at dataset again
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [195]:
#data summary
movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [196]:
#check for duplicates
movie_budgets_df.duplicated().any()

False

In [197]:
#check for null values
movie_budgets_df.isnull().any()

id                   False
release_date         False
movie                False
production_budget    False
domestic_gross       False
worldwide_gross      False
dtype: bool

This dataframe looks good: no missing data, no duplicates. 
1. We don't need the 'id' column so we are going to drop that. 
2. We will also check to see if release_date is a datetime object and will handle it accordingly.
3. Drop the '$' and ',' from 'production_budget', 'domestic_gross', and 'worldwide_gros' and also convert them into integer.

In [198]:
#drop 'id' column
movie_budgets_df = movie_budgets_df.drop('id', axis = 1)
movie_budgets_df.head(2)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [199]:
movie_budgets_df['release_date'][0]

'Dec 18, 2009'

In [200]:
#check to see if release_date is a datetime object
import datetime
isinstance(movie_budgets_df['release_date'][0], datetime.date)

False

In [201]:
#convert release_date to a datetime object
movie_budgets_df['release_date'] = pd.to_datetime(movie_budgets_df['release_date'])

In [202]:
#check again
isinstance(movie_budgets_df['release_date'][0], datetime.date)

True

In [203]:
#check for the money values and convert them to integer if needed
print(type(movie_budgets_df['production_budget'][0]))
print(type(movie_budgets_df['domestic_gross'][0]))
print(type(movie_budgets_df['worldwide_gross'][0]))

<class 'str'>
<class 'str'>
<class 'str'>

In [204]:
#delete '$' and ',' and convert to int
def dollar_clean(dataframe, col):
    dataframe[col] = dataframe[col].str.replace('$', '').str.replace(',', '').astype('int')
    return dataframe

In [205]:
#apply dollar_clean function to the 3 columns
dollar_clean(movie_budgets_df, 'production_budget')
dollar_clean(movie_budgets_df, 'domestic_gross')
dollar_clean(movie_budgets_df, 'worldwide_gross')

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,2009-12-18,Avatar,425000000,760507625,2776345279
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...
5777,2018-12-31,Red 11,7000,0,0
5778,1999-04-02,Following,6000,48482,240495
5779,2005-07-13,Return to the Land of Wonders,5000,1338,1338
5780,2015-09-29,A Plague So Pleasant,1400,0,0
5781,2005-08-05,My Date With Drew,1100,181041,181041

In [206]:
#obtain summary statistics
movie_budgets_df.describe()

       production_budget  domestic_gross  worldwide_gross
count       5.782000e+03    5.782000e+03     5.782000e+03
mean        3.158776e+07    4.187333e+07     9.148746e+07
std         4.181208e+07    6.824060e+07     1.747200e+08
min         1.100000e+03    0.000000e+00     0.000000e+00
25%         5.000000e+06    1.429534e+06     4.125415e+06
50%         1.700000e+07    1.722594e+07     2.798445e+07
75%         4.000000e+07    5.234866e+07     9.764584e+07
max         4.250000e+08    9.366622e+08     2.776345e+09

In [207]:
#create 'year' column
movie_budgets_df['release_year'] = pd.DatetimeIndex(movie_budgets_df['release_date']).year

In [208]:
movie_budgets_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,2009-12-18,Avatar,425000000,760507625,2776345279,2009
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,2019
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017

**movies_gross_df**

In [209]:
#see the data again
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [210]:
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [211]:
movie_gross_df.isnull().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

There are a lot of missing values in 'domestic_gross' and 'foreign_gross' but we won't be using these columns anyways. We will drop them.

In [212]:
movie_gross_df = movie_gross_df.drop(['domestic_gross', 'foreign_gross', 'year'], axis = 1)

In [213]:
movie_gross_df.head()

                                         title studio
0                                  Toy Story 3     BV
1                   Alice in Wonderland (2010)     BV
2  Harry Potter and the Deathly Hallows Part 1     WB
3                                    Inception     WB
4                          Shrek Forever After   P/DW

In [214]:
(movie_gross_df['studio'].isnull().sum() / len(movie_gross_df) * 100).round(2)

0.15

Missing values in 'studio' is not significant, we will safely drop them

In [215]:
movie_gross_df = movie_gross_df.dropna()

In [216]:
#check again
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   3382 non-null   object
 1   studio  3382 non-null   object
dtypes: object(2)
memory usage: 79.3+ KB

In [217]:
#rename column
movie_gross_df = movie_gross_df.rename(columns={'title':'movie'})
movie_gross_df.head(2)

                        movie studio
0                 Toy Story 3     BV
1  Alice in Wonderland (2010)     BV

Merging **movie_budgets_df** and **movie_gross_df** using 'movie'

In [218]:
#merging
movie_budgets_gross_df = pd.merge(movie_budgets_df, movie_gross_df, on='movie')
movie_budgets_gross_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony

In [219]:
len(movie_budgets_gross_df)

1246

In [220]:
#save
movie_budgets_gross_df.to_csv('movie_budgets_gross_df')

## I.2.4.b Popularity / Words of Mouth: Rating, Number of Votes, Popularity

**movies_df**

In [221]:
#let see the dataframe again
movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [222]:
#drop unnescessary columns
movies_df = movies_df.drop(['Unnamed: 0', 'genre_ids', 'id', 'original_title'], axis = 1)

In [223]:
movies_df.head()

,original_language,popularity,release_date,title,vote_average,vote_count
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,en,28.515,2010-05-07,Iron Man 2,6.8,12368
3,en,28.005,1995-11-22,Toy Story,7.9,10174
4,en,27.920,2010-07-16,Inception,8.3,22186

In [224]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  26517 non-null  object
 1   popularity         26517 non-null  float64
 2   release_date       26517 non-null  object
 3   title              26517 non-null  object
 4   vote_average       26517 non-null  float64
 5   vote_count         26517 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.2+ MB

In [225]:
#check to see if release_date is datetime object
import datetime
isinstance(movies_df['release_date'][0], datetime.date)

False

In [226]:
#convert release_date to datetime object
movies_df['release_date'] = pd.to_datetime(movies_df['release_date'])

In [227]:
#check again
isinstance(movies_df['release_date'][0], datetime.date)

True

In [228]:
movies_df['release_year'] = pd.DatetimeIndex(movies_df['release_date']).year

In [229]:
movies_df.head()

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010
2,en,28.515,2010-05-07,Iron Man 2,6.8,12368,2010
3,en,28.005,1995-11-22,Toy Story,7.9,10174,1995
4,en,27.920,2010-07-16,Inception,8.3,22186,2010

In [230]:
movies_df.isnull().any()

original_language    False
popularity           False
release_date         False
title                False
vote_average         False
vote_count           False
release_year         False
dtype: bool

This dataframe looks good: no missing data and datatype is correct

In [231]:
#check for duplicates
movies_df['title'].duplicated().sum()

1829

In [232]:
print(f'We have {len(movies_df)} title values in our dataset and there are {movies_df.title.nunique()} unique titlez')

We have 26517 title values in our dataset and there are 24688 unique titlez

In [233]:
#show duplicates
duplicates = movies_df[movies_df.duplicated(subset = "title")]
duplicates.head(20)

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
781,en,2.235,2010-01-03,Brotherhood,6.2,31,2010
1037,tl,1.504,2009-06-01,Boy,7.5,2,2009
1230,en,1.241,2010-09-25,All That Glitters,10.0,1,2010
1501,en,0.840,2010-02-06,Zero,5.8,6,2010
1708,en,0.624,2010-01-01,The Gift,9.0,1,2010
2081,en,0.600,2010-01-01,Alice in Wonderland,6.0,1,2010
2290,en,0.600,2010-07-31,Lies Between Friends,4.8,4,2010
2473,en,28.005,1995-11-22,Toy Story,7.9,10174,1995
2477,en,22.698,1999-11-24,Toy Story 2,7.5,7553,1999
2536,en,13.459,2010-12-10,TRON: Legacy,6.3,4387,2010
2560,en,12.254,2011-04-08,Your Highness,5.3,735,2011
2601,en,10.730,2011-08-17,The Awakening,6.4,782,2011
2673,en,8.994,2010-12-29,Blue Valentine,6.9,1677,2010
2717,en,8.319,2010-09-01,Rubber,5.9,417,2010
2803,en,7.357,2011-01-14,Barney's Version,7.2,210,2011
2854,en,6.667,2011-10-29,Zombie Apocalypse,4.4,56,2011
2901,en,6.136,2011-03-16,Detention,5.6,206,2011
2919,en,5.938,2011-05-13,Skateland,5.4,16,2011
2946,es,5.552,2011-08-19,The Last Circus,6.7,177,2011
2956,en,5.444,2011-07-15,Lucky,4.9,38,2011

In [234]:
len(duplicates)

1829

In [235]:
#check to see if duplicates are remakes of each other
duplicates[duplicates['title'] == 'Brotherhood']

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
781,en,2.235,2010-01-03,Brotherhood,6.2,31,2010
18130,en,4.191,2016-09-08,Brotherhood,6.1,54,2016

In [236]:
duplicates[duplicates['title'] == 'Boy']

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
1037,tl,1.504,2009-06-01,Boy,7.5,2,2009
5404,en,7.759,2012-03-02,Boy,7.5,149,2012
12991,da,0.718,2014-06-20,Boy,6.0,4,2014

In [237]:
duplicates[duplicates['title'] == 'The Gift']

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
1708,en,0.624,2010-01-01,The Gift,9.0,1,2010
13792,en,0.600,2014-07-26,The Gift,5.8,6,2014
14275,en,12.097,2015-08-07,The Gift,6.7,1797,2015
16400,en,0.631,2015-06-19,The Gift,9.0,1,2015

There are a lot of versions for many of these movies. We will use both 'movie' and 'release_year' to merge this dataset with the main dataframe so that we only keep the most relevant version of the movies.

In [238]:
#rename column
movies_df = movies_df.rename(columns={'title':'movie'})
movies_df.head(2)

,original_language,popularity,release_date,movie,vote_average,vote_count,release_year
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010

In [239]:
#save
movies_df.to_csv('movies_df')

In [240]:
#Let's only keep the lastest remake for simplicity
#sort from lastest to oldest
movies_df = movies_df.sort_values('release_year', ascending = False)

#keep the latest release/remake
movies_df = movies_df.drop_duplicates(subset = 'movie', keep = 'first')

In [241]:
#check again
movies_df.duplicated().sum()

0

## I.2.4.c Runtime

**title_basics_df**

In [242]:
#see the dataset again
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [243]:
#get data summary
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [244]:
#check for duplicates
title_basics_df.duplicated().any()

False

In [245]:
#check for null values
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title      True
start_year         False
runtime_minutes     True
genres              True
dtype: bool

In [246]:
#check for null values
title_basics_df.isnull().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

There is no duplicates in this dataframe but there are a lot of missing values in runtime_minutes, which is of our interest.

In [247]:
#calculate how big a percentage of the missing values in 'runtime_minutes' from the whole dataset is
((title_basics_df['runtime_minutes'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

21.72

21.71% is a big portion hence we cannot safely ignore or discard it. Let's check out its summary statistics

In [248]:
title_basics_df['runtime_minutes'].describe()

count    114405.000000
mean         86.187247
std         166.360590
min           1.000000
25%          70.000000
50%          87.000000
75%          99.000000
max       51420.000000
Name: runtime_minutes, dtype: float64

Both median and mean are quite close so we can pick either one. Let's go with median.

In [249]:
#fill missing values with median value
title_basics_df['runtime_minutes'] = title_basics_df['runtime_minutes'].fillna(title_basics_df['runtime_minutes'].median())

In [250]:
#check again
title_basics_df['runtime_minutes'].isnull().any()

False

In [251]:
#calculate how big a percentage of the missing values in 'original_title' from the whole dataset is
((title_basics_df['original_title'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

0.01

This is a very small percentage so we can drop it.

In [252]:
#calculate how big a percentage of the missing values in 'genres' from the whole dataset is
((title_basics_df['genres'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

3.7

This is also a very small percentage so we will drop it too.

In [253]:
#drop null values
title_basics_df = title_basics_df.dropna()

In [254]:
#check again
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title     False
start_year         False
runtime_minutes    False
genres             False
dtype: bool

In [255]:
#rename 'primary_title' to 'movie' to be consistent with our main dataframe
title_basics_df = title_basics_df.rename(columns={'primary_title':'movie'})
title_basics_df.head(2)

,tconst,movie,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [256]:
#drop 'original_title' because it's redundant
title_basics_df = title_basics_df.drop('original_title', axis = 1)
title_basics_df.head(2)

,tconst,movie,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"

In [257]:
#drop 'start_year' because it's redundant
title_basics_df = title_basics_df.drop('start_year', axis = 1)
title_basics_df.head(2)

,tconst,movie,runtime_minutes,genres
0,tt0063540,Sunghursh,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,114.0,"Biography,Drama"

## I.2.4.d Production Crew

**title_crew_df**

In [258]:
#look at the dataset again
title_crew_df.head(2)

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

In [259]:
title_crew_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [260]:
title_crew_df.isnull().sum()

tconst           0
directors     5727
writers      35883
dtype: int64

In [261]:
title_crew_df.duplicated().any().any()

False

This dataset has many missing values but no duplicate.

In [262]:
#calculate how significant the portion of missing values is
#for 'directors'
print('Percentage of missing values for Directors:', title_crew_df['directors'].isnull().sum() / len(title_crew_df) * 100)

#for 'writers'
print('Percentage of missing values for Writers:', title_crew_df['writers'].isnull().sum() / len(title_crew_df) * 100)

Percentage of missing values for Directors: 3.9187376833807748
Percentage of missing values for Writers: 24.55318042478651

----------------------------------------------------------------------------------

**title_aka_df**

In [310]:
#review dataset
title_aka_df.head()

      tconst  ordering                                    movie
0  tt0369610        10                            Джурасик свят
1  tt0369610        11                        Jurashikku warudo
2  tt0369610        12  Jurassic World: O Mundo dos Dinossauros
3  tt0369610        13                  O Mundo dos Dinossauros
4  tt0369610        14                           Jurassic World

In [264]:
#correct column names
title_aka_df = title_aka_df.rename(columns={'title_id':'tconst', 'title':'movie'})
title_aka_df = title_aka_df.drop(['is_original_title', 'attributes', 'language'], axis=1)
title_aka_df.head(2)

      tconst  ordering              movie region        types
0  tt0369610        10      Джурасик свят     BG          NaN
1  tt0369610        11  Jurashikku warudo     JP  imdbDisplay

In [265]:
title_aka_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 5 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    331703 non-null  object
 1   ordering  331703 non-null  int64
 2   movie     331703 non-null  object
 3   region    278410 non-null  object
 4   types     168447 non-null  object
dtypes: int64(1), object(4)
memory usage: 12.7+ MB

In [266]:
title_aka_df.isnull().sum()

tconst           0
ordering         0
movie            0
region       53293
types       163256
dtype: int64

In [267]:
title_aka_df.duplicated().any()

False

There are a lot of missing values in 'region' and 'types.' However, we are not interested in these attributes so we can safely drop these columns.

In [268]:
#drop null values
title_aka_df = title_aka_df.drop(['region', 'types'], axis=1)
title_aka_df.head(2)

      tconst  ordering              movie
0  tt0369610        10      Джурасик свят
1  tt0369610        11  Jurashikku warudo

----------------------------------------------------------------------------------

**title_principals_df**

In [269]:
#preview dataset again
title_principals_df.head(2)

      tconst  ordering     nconst  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

In [270]:
#check for length
len(title_principals_df)

1028186

In [271]:
#get data summary
title_principals_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   nconst      1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [272]:
#check for null values
title_principals_df.isnull().sum()

tconst             0
ordering           0
nconst             0
category           0
job           850502
characters    634826
dtype: int64

In [273]:
#check for duplicates
title_principals_df.duplicated().any()

False

In [274]:
#calculate percentage of missing values in 'job'
print('Percentage of missing values in Job:', title_principals_df['job'].isnull().sum() / len(title_principals_df) * 100)

#calculate percentage of missing values in 'characters'
print('Percentage of missing values in Characters:', title_principals_df['characters'].isnull().sum() / len(title_principals_df) * 100)

Percentage of missing values in Job: 82.71869097614633
Percentage of missing values in Characters: 61.74233066779746

This dataset seems to be not very useful for our analysis due to missing data.

In [311]:
#drop columns that have too many missing values
title_principals_df = title_principals_df.drop(['job', 'characters'], axis=1)

----------------------------------------------------------------------------------

In [ ]:
#merge datasets that have 'ordering' in common
crew_title_df = pd.merge(title_aka_df, title_principals_df, on='ordering')

----------------------------------------------------------------------------------

**name_basics_df**

In [275]:
#see the dataset again
name_basics_df.head(2)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

In [276]:
len(name_basics_df)

606648

In [277]:
name_basics_df = name_basics_df.drop(['birth_year', 'death_year', 'primary_profession'], axis=1)

In [278]:
name_basics_df.head(2)

      nconst       primary_name                         known_for_titles
0  nm0061671  Mary Ellen Bauder  tt0837562,tt2398241,tt0844471,tt0118553
1  nm0061865       Joseph Bauer  tt0896534,tt6791238,tt0287072,tt1682940

In [279]:
#get data summary
name_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 3 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   nconst            606648 non-null  object
 1   primary_name      606648 non-null  object
 2   known_for_titles  576444 non-null  object
dtypes: object(3)
memory usage: 13.9+ MB

In [280]:
#check for null values
name_basics_df.isnull().sum()

nconst                  0
primary_name            0
known_for_titles    30204
dtype: int64

In [281]:
#check for duplicates
name_basics_df.duplicated().any()

False

In [282]:
#calculate the percentage of missing values
print('Percentage of missing value in known_for_title:', name_basics_df['known_for_titles'].isnull().sum() / len(name_basics_df) *100)

Percentage of missing value in known_for_title: 4.97883451358943

This is not a large percentage so we are dropping it

In [283]:
#drop null values
name_basics_df = name_basics_df.dropna()

In [284]:
#check again
name_basics_df.isnull().sum()

nconst              0
primary_name        0
known_for_titles    0
dtype: int64

----------------------------------------------------------------------------------

**reviews_df**

In [285]:
#preview data again
reviews_df.head(2)

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"

In [286]:
#check for dataset size
len(reviews_df)

54432

In [287]:
#drop uninteresting features
reviews_df = reviews_df.drop(['review', 'rating', 'fresh', 'top_critic', 'date'], axis=1)

In [288]:
#check
reviews_df.head(2)

   id          critic        publisher
0   3      PJ Nabarro  Patrick Nabarro
1   3  Annalee Newitz          io9.com

In [289]:
#get data summary
reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         54432 non-null  int64
 1   critic     51710 non-null  object
 2   publisher  54123 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.2+ MB

In [290]:
#check for null values
reviews_df.isnull().sum()

id              0
critic       2722
publisher     309
dtype: int64

In [291]:
#calculate percentage of missing values in 'critic'
print('Percentage of missing values in Critic:', reviews_df['critic'].isnull().sum() / len(reviews_df * 100))

#calculate percentage of missing values in 'publisher'
print('Percentage of missing values in Publisher:', reviews_df['publisher'].isnull().sum() / len(reviews_df * 100))

Percentage of missing values in Critic: 0.05000734861845973
Percentage of missing values in Publisher: 0.005676807760141093

In [292]:
#drop nul values
reviews_df = reviews_df.dropna()

In [293]:
#check for null values gain
reviews_df.isnull().sum()

id           0
critic       0
publisher    0
dtype: int64

In [294]:
#check for duplicates
reviews_df.duplicated().sum()

31

In [295]:
#let's look at duplicates
reviews_df[reviews_df['publisher'].duplicated()]

         id             critic             publisher
67        3     Laura Clifford       Reeling Reviews
104       3      Mike D'Angelo               AV Club
150       3      Robbie Collin  Daily Telegraph (UK)
154       3         Damon Wise       Empire Magazine
155       3          Guy Lodge                HitFix
...     ...                ...                   ...
54427  2000      Laura Sinagra         Village Voice
54428  2000  Michael Szymanski            Zap2it.com
54429  2000       Emanuel Levy       EmanuelLevy.Com
54430  2000   Christopher Null        Filmcritic.com
54431  2000    Nicolas Lacroix          Showbizz.net

[50177 rows x 3 columns]

**movie_info_df**

In [296]:
#let's see the dataset
movie_info_df.head(2)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One

In [297]:
#check for dataset size
len(movie_info_df)

1560

In [298]:
#remove uninteresting columns
movie_info_df = movie_info_df.drop(['genre', 'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime', 'studio'], axis=1)

In [299]:
#check
movie_info_df.head(2)

,id,synopsis,rating,director,writer
0,1,"This gritty, fast-paced, and innovative police...",R,William Friedkin,Ernest Tidyman
1,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo

In [300]:
#get data summary
movie_info_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1560 non-null   int64
 1   synopsis  1498 non-null   object
 2   rating    1557 non-null   object
 3   director  1361 non-null   object
 4   writer    1111 non-null   object
dtypes: int64(1), object(4)
memory usage: 61.1+ KB

In [301]:
#check for null values
movie_info_df.isnull().sum()

id            0
synopsis     62
rating        3
director    199
writer      449
dtype: int64

In [302]:
#check for duplicates
movie_info_df.duplicated().any()

False

In [303]:
#calculate percentage of null values for 'synopsis'
print('Percentage of missing values for Sypnosis is:', movie_info_df['synopsis'].isnull().sum() / len(movie_info_df) * 100)

#calculate percentage of null values for 'director'
print('Percentage of missing values for Director is:', movie_info_df['director'].isnull().sum() / len(movie_info_df) * 100)

#calculate percentage of null values for 'writer'
print('Percentage of missing values for Writer is:', movie_info_df['writer'].isnull().sum() / len(movie_info_df) * 100)

Percentage of missing values for Sypnosis is: 3.974358974358974
Percentage of missing values for Director is: 12.756410256410255
Percentage of missing values for Writer is: 28.78205128205128

In [304]:
#merge dataset that has 'id' in common
movie_reviews_df = pd.merge(movie_info_df, reviews_df, on='id')

In [305]:
#see new dataset
movie_reviews_df.head()

,id,synopsis,rating,director,writer,critic,publisher
0,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo,PJ Nabarro,Patrick Nabarro
1,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo,Annalee Newitz,io9.com
2,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo,Sean Axmaker,Stream on Demand
3,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo,Daniel Kasman,MUBI
4,3,"New York City, not-too-distant-future: Eric Pa...",R,David Cronenberg,David Cronenberg|Don DeLillo,Michelle Orange,Capital New York

We can see that a movie can be reviewed by many different critics and publishers.

## I.2.5 Merging Everything Together

Let's now merge it all together **movie_budgets_gross_df** and **movies_df** using 'movie' and 'release_year'

There is a big difference between 2 dataframes so we are expecting some data downside when merging.

In [306]:
#merge using 'movie' and 'release_date'
df1 = pd.merge(movie_budgets_gross_df, movies_df, on=['movie', 'release_date'])

In [307]:
#preview
df1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year_x,studio,original_language,popularity,vote_average,vote_count,release_year_y
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,2011
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,2015
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,2018
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,2017
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,2015

In [115]:
#check for size
df1.shape

(902, 12)

In [116]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 902 entries, 0 to 901
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       902 non-null    datetime64[ns]
 1   movie              902 non-null    object
 2   production_budget  902 non-null    int64
 3   domestic_gross     902 non-null    int64
 4   worldwide_gross    902 non-null    int64
 5   release_year_x     902 non-null    int64
 6   studio             902 non-null    object
 7   original_language  902 non-null    object
 8   popularity         902 non-null    float64
 9   vote_average       902 non-null    float64
 10  vote_count         902 non-null    int64
 11  release_year_y     902 non-null    int64
dtypes: datetime64[ns](1), float64(2), int64(6), object(3)
memory usage: 91.6+ KB

In [117]:
df1['movie'].duplicated().sum()

0

Next, merging **df_1** with **title_rating_basics_df**

In [118]:
merged_df_1 = pd.merge(df1, title_basics_df, on=['movie'])
merged_df_1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year_x,studio,original_language,popularity,vote_average,vote_count,release_year_y,tconst,runtime_minutes,genres
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,2011,tt1298650,136.0,"Action,Adventure,Fantasy"
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,2015,tt2395427,141.0,"Action,Adventure,Sci-Fi"
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,2018,tt4154756,149.0,"Action,Adventure,Sci-Fi"
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,2017,tt0974015,120.0,"Action,Adventure,Fantasy"
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,2015,tt2379713,148.0,"Action,Adventure,Thriller"

In [119]:
len(merged_df_1)

1134

In [120]:
merged_df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1134 entries, 0 to 1133
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       1134 non-null   datetime64[ns]
 1   movie              1134 non-null   object
 2   production_budget  1134 non-null   int64
 3   domestic_gross     1134 non-null   int64
 4   worldwide_gross    1134 non-null   int64
 5   release_year_x     1134 non-null   int64
 6   studio             1134 non-null   object
 7   original_language  1134 non-null   object
 8   popularity         1134 non-null   float64
 9   vote_average       1134 non-null   float64
 10  vote_count         1134 non-null   int64
 11  release_year_y     1134 non-null   int64
 12  tconst             1134 non-null   object
 13  runtime_minutes    1134 non-null   float64
 14  genres             1134 non-null   object
dtypes: datetime64[ns](1), float64(3), int64(6), object(5)
memory usage: 141.8+ KB

In [121]:
merged_df_1.duplicated().sum()

0

In [122]:
#drop unneeded columns
merged_df_1 = merged_df_1.drop(['release_year_y'], axis = 1)

In [123]:
merged_df_1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year_x,studio,original_language,popularity,vote_average,vote_count,tconst,runtime_minutes,genres
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,tt1298650,136.0,"Action,Adventure,Fantasy"
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,tt2395427,141.0,"Action,Adventure,Sci-Fi"
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,tt4154756,149.0,"Action,Adventure,Sci-Fi"
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,tt0974015,120.0,"Action,Adventure,Fantasy"
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,tt2379713,148.0,"Action,Adventure,Thriller"

In [124]:
merged_df_1 = merged_df_1.rename(columns={'release_year_x':'release_year'})

## I.2.6 Quick Data Analysis

We need to know the profit which is calculated by taking the difference between 'worldwide_gross' and 'production_budget'

In [125]:
#Let's calculate profit each movie makes
#Add 'profit'
merged_df_1['profit'] = merged_df_1.apply(lambda x: x['worldwide_gross'] - x['production_budget'], axis = 1)

In [126]:
merged_df_1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio,original_language,popularity,vote_average,vote_count,tconst,runtime_minutes,genres,profit
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,tt1298650,136.0,"Action,Adventure,Fantasy",635063875
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,tt2395427,141.0,"Action,Adventure,Sci-Fi",1072413963
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,tt4154756,149.0,"Action,Adventure,Sci-Fi",1748134200
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,tt0974015,120.0,"Action,Adventure,Fantasy",355945209
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,tt2379713,148.0,"Action,Adventure,Thriller",579620923

In [127]:
merged_df_1.to_csv('merged_df_1')

In [128]:
merged_df_1.describe()

,production_budget,domestic_gross,worldwide_gross,release_year,popularity,vote_average,vote_count,runtime_minutes,profit
count,1.134000e+03,1.134000e+03,1.134000e+03,1134.000000,1134.000000,1134.000000,1134.000000,1134.000000,1.134000e+03
mean,4.811613e+07,6.394856e+07,1.580578e+08,2014.095238,14.162361,6.382011,2433.023810,103.956790,1.099416e+08
std,5.588811e+07,8.680479e+07,2.376801e+08,2.546603,7.834851,0.762847,3026.807166,22.342217,1.969735e+08
min,5.000000e+04,0.000000e+00,1.706100e+04,2010.000000,0.600000,4.000000,11.000000,3.000000,-1.104502e+08
25%,1.200000e+07,1.243179e+07,2.204251e+07,2012.000000,9.122000,5.900000,527.250000,91.000000,4.440444e+06
50%,2.800000e+07,3.605741e+07,7.106386e+07,2014.000000,12.172000,6.400000,1326.000000,103.000000,3.841453e+07
75%,6.000000e+07,7.390688e+07,1.708577e+08,2016.000000,16.784250,6.900000,2880.000000,116.000000,1.235422e+08
max,4.106000e+08,7.000596e+08,2.048134e+09,2018.000000,80.773000,8.400000,22186.000000,180.000000,1.748134e+09